A2ThreeD/esp32-bt2ps2/main/main.cpp
/*
ESP32-BT2PS2
Software for Espressif ESP32 chipsets for PS/2 emulation and Bluetooth BLE/Classic HID keyboard/mouse interfacing.
Thanks to all the pioneers who worked on the code libraries that made this project possible, check them on the README!
Copyright Humberto Mockel - Hamcode - 2024
hamberthm@gmail.com
Dedicated to all who love me and all who I love.
Never stop dreaming.
*/

#include "../include/globals.hpp"
#include "nvs_flash.h"
#include "esp_system.h"
#include <driver/gpio.h>
#include <iostream>
#include <cmath>
#include "../include/bt_keyboard.hpp" // Interface with a BT/BLE peripheral device (Keyboard & Mouse)
#include "../include/esp32-ps2dev.h"  // Emulate a PS/2 device
#include "../include/amiga-db9-mouse.hpp"

#define BT2PS2_MOUSE_DEBUG 0

/////////////////////////////// USER ADJUSTABLE VARIABLES //////////////////////////////////////////////////

// PS/2 emulation variables
const int KB_CLK_PIN = 22; // VERY IMPORTANT: Not all pins are suitable out-of-the-box. Check README for more info!
const int KB_DATA_PIN = 23;

// Amiga DB9 quadrature output pins
const int MOUSE_XA_PIN = 25;
const int MOUSE_XB_PIN = 26;
const int MOUSE_YA_PIN = 27;
const int MOUSE_YB_PIN = 14;
const int MOUSE_LEFT_BTN_PIN = 33;
const int MOUSE_RIGHT_BTN_PIN = 32;
const int MOUSE_MIDDLE_BTN_PIN = 13;

const bool pairing_at_startup = true; // set to 'true' if you want BT & BLE pairing at startup (slower startup)
// otherwise, pairing must be requested by pressing BOOT button (or set GPIO 0 to ground) during execution

///////////////////////////////////////////////////////////////////////////////////////////////////////////

static constexpr char const *TAG = "BT2PS2 Main Module";
static bool pairingRequested = false; // pairing requested flag
static bool pairingAborted = false;   // pairing aborted flag
static bool bleNowScanning = false;   // BLE scanning daemon in course flag
static bool codeHandlerActive = false;
void mouse_task(void *arg);
void ble_connection_daemon(void *arg);
TaskHandle_t pairing_task_handle;

AmigaDB9Mouse mouse({
    static_cast<gpio_num_t>(MOUSE_XA_PIN),
    static_cast<gpio_num_t>(MOUSE_XB_PIN),
    static_cast<gpio_num_t>(MOUSE_YA_PIN),
    static_cast<gpio_num_t>(MOUSE_YB_PIN),
    static_cast<gpio_num_t>(MOUSE_LEFT_BTN_PIN),
    static_cast<gpio_num_t>(MOUSE_RIGHT_BTN_PIN),
    static_cast<gpio_num_t>(MOUSE_MIDDLE_BTN_PIN),
});

esp32_ps2dev::PS2Keyboard keyboard(KB_CLK_PIN, KB_DATA_PIN);

// BTKeyboard section
BTKeyboard bt_keyboard;

int NumDigits(int x) // Returns number of digits in keyboard code
{
    x = abs(x);
    return (x < 10 ? 1 : (x < 100 ? 2 : (x < 1000 ? 3 : (x < 10000 ? 4 : (x < 100000 ? 5 : (x < 1000000 ? 6 : (x < 10000000 ? 7 : (x < 100000000 ? 8 : (x < 1000000000 ? 9 : 10)))))))));
}

void pairing_handler(uint32_t pid) // This handler deals with BT Classic's manual code entry. DEFAULT CODE FOR LEGACY PAIRING IS 1234 (When no signaling occurs)
{
    codeHandlerActive = true; // LED control taken from main loop

    int x = (int)pid;
    std::cout << "Please enter the following pairing code, "
              << std::endl
              << "followed by ENTER on your keyboard: "
              << pid
              << std::endl;

    for (int i = 0; i < 10; i++) // Flash quickly many times to alert user of incoming code display
    {
        gpio_set_level(GPIO_NUM_2, 1);
        vTaskDelay(50 / portTICK_PERIOD_MS);
        gpio_set_level(GPIO_NUM_2, 0);
        vTaskDelay(50 / portTICK_PERIOD_MS);
    }

    int dig = NumDigits(x); // How many digits does our code have?

    for (int i = 1; i <= dig; i++)
    {
        vTaskDelay(2000 / portTICK_PERIOD_MS);
        ESP_LOGW(TAG, "PAIRING CODE (TYPE ON KEYBOARD AND PRESS ENTER): %d ", pid);
        int flash = ((int)((pid / pow(10, (dig - i)))) % 10); // This extracts one ditit at a time from our code
        ESP_LOGI(TAG, "Flashing %d times", flash);
        for (int n = 0; n < flash; n++) // Flash the LED as many times as the digit
        {
            gpio_set_level(GPIO_NUM_2, 1);
            vTaskDelay(200 / portTICK_PERIOD_MS);
            gpio_set_level(GPIO_NUM_2, 0);
            vTaskDelay(200 / portTICK_PERIOD_MS);
        }

        if (flash < 1) // If digit is 0, keep a steady light for 1.5sec
        {
            gpio_set_level(GPIO_NUM_2, 1);
            vTaskDelay(1500 / portTICK_PERIOD_MS);
            gpio_set_level(GPIO_NUM_2, 0);
            vTaskDelay(200 / portTICK_PERIOD_MS);
        }
    }

    vTaskDelay(1000 / portTICK_PERIOD_MS);

    for (int i = 0; i < 10; i++) // Quick flashes indicate end of code display
    {

        gpio_set_level(GPIO_NUM_2, 1);
        vTaskDelay(50 / portTICK_PERIOD_MS);
        gpio_set_level(GPIO_NUM_2, 0);
        vTaskDelay(50 / portTICK_PERIOD_MS);
    }

    codeHandlerActive = false; // LED control returned to main loop
}

static void IRAM_ATTR pairing_scan(void *arg = NULL)
{
    BTKeyboard::isConnected = false;
    pairingRequested = true;

    gpio_set_level(GPIO_NUM_2, 0); // Turn off LED for pairing

    while (bleNowScanning)
    {
        vTaskDelay(500 / portTICK_PERIOD_MS); // shield for BLE daemon
    }

    ESP_LOGI(TAG, "/////////////////// PAIRING ACTIVATED ////////////////////////");
    ESP_LOGI(TAG, "Scanning...");

    while (!BTKeyboard::isConnected && !pairingAborted)
    {
        bt_keyboard.devices_scan();
        if (BTKeyboard::btFound)
        {
            BTKeyboard::btFound = false;
            for (int i = 0; i < 60; i++)
            {
                if (BTKeyboard::isConnected)
                    break;
                ESP_LOGI(TAG, "Waiting for BT Classic manual code entry...");
                vTaskDelay(1000 / portTICK_PERIOD_MS);
            }
        }
        else
        {
            vTaskDelay(1000 / portTICK_PERIOD_MS);
            ESP_LOGI(TAG, "Pairing re-scan...");
        }
    } // Required to discover new keyboards and for pairing
      // Default duration is 5 seconds

    ESP_LOGI(TAG, "/////////////////// PAIRING ENDED ////////////////////////");

    pairingRequested = false;
    pairingAborted = false;
    gpio_set_level(GPIO_NUM_2, 1); // success, device found (or not and it was aborted, but we are positive in life)

    vTaskDelete(NULL);

    ESP_LOGE(TAG, "Pairing task could not be ended! You shouldn't be reading this, panic!");
}

static void IRAM_ATTR start_pairing_scan(void *arg = NULL)
{
    xTaskCreatePinnedToCore(pairing_scan, "pairing_task", 4096, NULL, 0, &pairing_task_handle, 0);
}

extern "C"
{

