A2ThreeD/esp32-bt2ps2/main/main.cpp
    void app_main(void)
    {
        gpio_config_t io_conf; // PIN CONFIGURARION SECTION: CRITICAL

        io_conf.intr_type = GPIO_INTR_DISABLE;
        io_conf.mode = GPIO_MODE_OUTPUT_OD;
        io_conf.pin_bit_mask = (1ULL << KB_DATA_PIN);
        io_conf.pull_down_en = GPIO_PULLDOWN_DISABLE;
        io_conf.pull_up_en = GPIO_PULLUP_DISABLE;
        gpio_config(&io_conf);
        io_conf.pin_bit_mask = (1ULL << KB_CLK_PIN);
        gpio_config(&io_conf);

        io_conf.intr_type = GPIO_INTR_DISABLE; // PAIRING BUTTON CONFIGURATION (GPIO 0 OR "BOOT BUTTON")
        io_conf.mode = GPIO_MODE_INPUT;
        io_conf.pin_bit_mask = (1ULL << GPIO_NUM_0);
        io_conf.pull_down_en = GPIO_PULLDOWN_DISABLE;
        io_conf.pull_up_en = GPIO_PULLUP_ENABLE;
        gpio_config(&io_conf);

        // init PS/2 emulation first

        gpio_reset_pin(GPIO_NUM_2);                       // using built-in LED for notifications
        gpio_set_direction(GPIO_NUM_2, GPIO_MODE_OUTPUT); // Set the GPIO as a push/pull output
        gpio_set_level(GPIO_NUM_2, 1);

        mouse.begin();
        keyboard.begin();

        gpio_set_level(GPIO_NUM_2, 0);

        // init BTKeyboard
        esp_err_t ret;

        // To test the Pairing code entry, uncomment the following line as pairing info is
        // kept in the nvs. Pairing will then be required on every boot.
        // ESP_ERROR_CHECK(nvs_flash_erase());

        ret = nvs_flash_init();
        if ((ret == ESP_ERR_NVS_NO_FREE_PAGES) || (ret == ESP_ERR_NVS_NEW_VERSION_FOUND))
        {
            ESP_ERROR_CHECK(nvs_flash_erase());
            ret = nvs_flash_init();
        }
        ESP_ERROR_CHECK(ret);

        const bool btSetupOk = bt_keyboard.setup(pairing_handler); // Must be called once
        if (btSetupOk)
        {
            if (pairing_at_startup)
            {
                start_pairing_scan();
            }
            else
            {
                gpio_set_level(GPIO_NUM_2, 1); // let the fun begin!
            }
        }
        else
        {
            ESP_LOGE(TAG, "bt_keyboard.setup() returned false. Keeping PS/2 initialized and running without BT input.");
            gpio_set_level(GPIO_NUM_2, 1);
            while (true)
            {
                vTaskDelay(1000 / portTICK_PERIOD_MS);
            }
        }

        // time variables, don't adjust unless you know what you're doing
        uint8_t typematicRate = 20;    // characters per second in Typematic mode
        uint16_t typematicDelay = 500; // ms to become Typematic

        // fixed stuff
        uint8_t cycle = 1000 / typematicRate;            // keywait timeout in ms. Important so we can check connection and do Typematic
        TickType_t repeat_period = pdMS_TO_TICKS(cycle); // keywait timeout in ticks. Important so we can check connection and do Typematic
        BTKeyboard::KeyInfo info;                        // freshly received
        BTKeyboard::KeyInfo infoBuf;                     // currently pressed
        BTKeyboard::KeyInfo_CCONTROL infoCCONTROL;       // freshly received multimedia (CCONTROL) keys
        BTKeyboard::KeyInfo_CCONTROL infoBufCCONTROL;    // currently pressed multimedia (CCONTROL) keys
        TaskHandle_t mouse_task_handle;                  // mouse uses it's own task. Mouse is important
        TaskHandle_t ble_connection_daemon_handle;       // the BLE daemon constantly scans for BLE previously bonded devices

        bool found = false;                 // just an innocent flasg I mean flag
        int typematicLeft = typematicDelay; // timekeeping

        info.modifier = infoBuf.modifier = (BTKeyboard::KeyModifier)0;

        for (int j = 0; j < BTKeyboard::MAX_KEY_COUNT; j++)
        {
            infoBuf.keys[j] = 0;
            info.keys[j] = 0;
            infoBufCCONTROL.keys[j] = 0;
            infoCCONTROL.keys[j] = 0;
        }

        xTaskCreatePinnedToCore(mouse_task, "mouse_task", 4096, NULL, 9, &mouse_task_handle, 0);
        xTaskCreatePinnedToCore(ble_connection_daemon, "ble_task", 4096, NULL, 0, &ble_connection_daemon_handle, 0);

        while (true)
        {
            if (bt_keyboard.wait_for_low_event(info, repeat_period))
            {
                // Handle modifier keys
                if (info.modifier != infoBuf.modifier)
                {

                    // MODIFIER SECTION

                    // Are you a communist?
                    if (((uint8_t)info.modifier & 0x0f) != ((uint8_t)infoBuf.modifier & 0x0f))
                    {

                        // LSHIFT
                        if (((uint8_t)info.modifier & 0x02) != ((uint8_t)infoBuf.modifier & 0x02))
                        {
                            if ((uint8_t)info.modifier & 0x02)
                            {
                                ESP_LOGD(TAG, "Down key: LSHIFT");
                                keyboard.keydown(esp32_ps2dev::scancodes::Key::K_LSHIFT);
                            }
                            else
                            {
                                ESP_LOGD(TAG, "Up key: LSHIFT");
                                keyboard.keyup(esp32_ps2dev::scancodes::Key::K_LSHIFT);
                            }
                        }

                        // LCTRL
                        if (((uint8_t)info.modifier & 0x01) != ((uint8_t)infoBuf.modifier & 0x01))
                        {
                            if ((uint8_t)info.modifier & 0x01)
                            {
                                ESP_LOGD(TAG, "Down key: LCTRL");
                                keyboard.keydown(esp32_ps2dev::scancodes::Key::K_LCTRL);
                            }
                            else
                            {
                                ESP_LOGD(TAG, "Up key: LCTRL");
                                keyboard.keyup(esp32_ps2dev::scancodes::Key::K_LCTRL);
                            }
                        }

                        // LMETA
                        if (((uint8_t)info.modifier & 0x08) != ((uint8_t)infoBuf.modifier & 0x08))
                        {
                            if ((uint8_t)info.modifier & 0x08)
                            {
                                ESP_LOGD(TAG, "Down key: LMETA");
                                keyboard.keydown(esp32_ps2dev::scancodes::Key::K_LSUPER);
                            }
                            else
                            {
                                ESP_LOGD(TAG, "Up key: LMETA");
                                keyboard.keyup(esp32_ps2dev::scancodes::Key::K_LSUPER);
                            }
                        }

                        // LALT
                        if (((uint8_t)info.modifier & 0x04) != ((uint8_t)infoBuf.modifier & 0x04))
                        {
                            if ((uint8_t)info.modifier & 0x04)
                            {
                                ESP_LOGD(TAG, "Down key: LALT");
                                keyboard.keydown(esp32_ps2dev::scancodes::Key::K_LALT);
                            }
                            else
                            {
                                ESP_LOGD(TAG, "Up key: LALT");
                                keyboard.keyup(esp32_ps2dev::scancodes::Key::K_LALT);
                            }
                        }
                    }

