A2ThreeD/esp32-bt2ps2/main/main.cpp
                    // Are you a capitalist?
                    if (((uint8_t)info.modifier & 0xf0) != ((uint8_t)infoBuf.modifier & 0xf0))
                    {

                        // RSHIFT
                        if (((uint8_t)info.modifier & 0x20) != ((uint8_t)infoBuf.modifier & 0x20))
                        {
                            if ((uint8_t)info.modifier & 0x20)
                            {
                                ESP_LOGD(TAG, "Down key: RSHIFT");
                                keyboard.keydown(esp32_ps2dev::scancodes::Key::K_RSHIFT);
                            }
                            else
                            {
                                ESP_LOGD(TAG, "Up key: RSHIFT");
                                keyboard.keyup(esp32_ps2dev::scancodes::Key::K_RSHIFT);
                            }
                        }

                        // RCTRL
                        if (((uint8_t)info.modifier & 0x10) != ((uint8_t)infoBuf.modifier & 0x10))
                        {
                            if ((uint8_t)info.modifier & 0x10)
                            {
                                ESP_LOGD(TAG, "Down key: RCTRL");
                                keyboard.keydown(esp32_ps2dev::scancodes::Key::K_RCTRL);
                            }
                            else
                            {
                                ESP_LOGD(TAG, "Up key: RCTRL");
                                keyboard.keyup(esp32_ps2dev::scancodes::Key::K_RCTRL);
                            }
                        }

                        // RMETA
                        if (((uint8_t)info.modifier & 0x80) != ((uint8_t)infoBuf.modifier & 0x80))
                        {
                            if ((uint8_t)info.modifier & 0x80)
                            {
                                ESP_LOGD(TAG, "Down key: RMETA");
                                keyboard.keydown(esp32_ps2dev::scancodes::Key::K_RSUPER);
                            }
                            else
                            {
                                ESP_LOGD(TAG, "Up key: RMETA");
                                keyboard.keyup(esp32_ps2dev::scancodes::Key::K_RSUPER);
                            }
                        }

                        // RALT
                        if (((uint8_t)info.modifier & 0x40) != ((uint8_t)infoBuf.modifier & 0x40))
                        {
                            if ((uint8_t)info.modifier & 0x40)
                            {
                                ESP_LOGD(TAG, "Down key: RALT");
                                keyboard.keydown(esp32_ps2dev::scancodes::Key::K_RALT);
                            }
                            else
                            {
                                ESP_LOGD(TAG, "Up key: RALT");
                                keyboard.keyup(esp32_ps2dev::scancodes::Key::K_RALT);
                            }
                        }
                    }
                }

                // KEY SECTION (always tested)
                // release the keys that have been just released
                for (int i = 0; i < BTKeyboard::MAX_KEY_COUNT; i++)
                {
                    if (!infoBuf.keys[i])
                    { // Detect END FLAG
                        break;
                    }
                    for (int j = 0; (info.keys[j]) && (j < BTKeyboard::MAX_KEY_COUNT); j++)
                    {
                        if (infoBuf.keys[i] == info.keys[j])
                        {
                            found = true;
                            break;
                        }
                    }
                    if (!found)
                    {
                        ESP_LOGD(TAG, "Up key: %x", infoBuf.keys[i]);
                        keyboard.keyHid_send(infoBuf.keys[i], false);
                        gpio_set_level(GPIO_NUM_2, 1);
                    }
                    else
                    {
                        found = false;
                    }
                }

                // press the keys that have been just pressed
                for (int i = 0; i < BTKeyboard::MAX_KEY_COUNT; i++)
                {
                    if (!info.keys[i])
                    { // Detect END FLAG
                        break;
                    }
                    for (int j = 0; (infoBuf.keys[j]) && (j < BTKeyboard::MAX_KEY_COUNT); j++)
                    {
                        if (info.keys[i] == infoBuf.keys[j])
                        {
                            found = true;
                            break;
                        }
                    }
                    if (!found)
                    {
                        ESP_LOGD(TAG, "Down key: %x", info.keys[i]);
                        keyboard.keyHid_send(info.keys[i], true);
                        gpio_set_level(GPIO_NUM_2, 0);
                    }
                    else
                    {
                        found = false;
                    }
                }

                infoBuf = info;                 // Now all the keys are handled, we save the state
                typematicLeft = typematicDelay; // Typematic timer reset
            }

            else
            {
                if (infoBuf.keys[0])
                { // If any key held down, do the Typematic dance
                    typematicLeft = typematicLeft - cycle;
                    if (typematicLeft <= 0)
                    {
                        for (int i = 1; i < BTKeyboard::MAX_KEY_COUNT; i++)
                        {
                            if (infoBuf.keys[i] == 0)
                            {
                                if (infoBuf.keys[i - 1] != 0x39)
                                { // Please don't repeat caps, it's ugly
                                    ESP_LOGD(TAG, "Down key: %x", infoBuf.keys[i - 1]);
                                    keyboard.keyHid_send(infoBuf.keys[i - 1], true); // Resend the last key
                                }
                                break;
                            }
                        }
                    }
                }

                if (!pairingRequested)
                {
                    gpio_set_level(GPIO_NUM_2, 1); // LED up for every key cycle

                    if (!gpio_get_level(GPIO_NUM_0)) // Pairing request via BOOT button (GPIO_0) check
                    {
                        pairingRequested = true;
                        start_pairing_scan();
                    }
                }
                else
                {
                    if (!pairingAborted && !codeHandlerActive) // code handler needs LED control, no touchy while is active!
                    {
                        gpio_set_level(GPIO_NUM_2, 0); // LED down while pairing is active
                    }
                    else if (!codeHandlerActive)
                    {
                        gpio_set_level(GPIO_NUM_2, 1); // LED up while pairin is active but abort is requested
                    }
                    if (!gpio_get_level(GPIO_NUM_0)) // Pairing request via BOOT button (GPIO_0) check
                    {
                        vTaskDelay(2000 / portTICK_PERIOD_MS);
                        if (!gpio_get_level(GPIO_NUM_0))
                            pairingAborted = true; // User pressed and hold the pairing button for 2sec while it was active. This is an abort request!
                    }
                }
            }

            ////////////////////// MULTIMEDIA KEYS (CCONTROL HID USAGE CODES) SECTION

            if (bt_keyboard.wait_for_low_event_CCONTROL(infoCCONTROL, 0)) // return immediately if queue empty
            {
                // KEY SECTION (always tested)
                // release the keys that have been just released
                for (int i = 0; i < BTKeyboard::MAX_KEY_COUNT; i++)
                {
                    if (!infoBufCCONTROL.keys[i]) // Detect END FLAG
                        break;
                    for (int j = 0; (infoCCONTROL.keys[j]) && (j < BTKeyboard::MAX_KEY_COUNT); j++)
                    {
                        if (infoBufCCONTROL.keys[i] == infoCCONTROL.keys[j])
                        {
                            found = true;
                            break;
                        }
                    }
                    if (!found)
                    {
                        ESP_LOGD(TAG, "Up CCONTROL key: %x", infoBufCCONTROL.keys[i]);
                        keyboard.keyHid_send_CCONTROL(infoBufCCONTROL.keys[i], false);
                        gpio_set_level(GPIO_NUM_2, 1);
                    }
                    else
                        found = false;
                }

                // press the keys that have been just pressed
                for (int i = 0; i < BTKeyboard::MAX_KEY_COUNT; i++)
                {
                    if (!infoCCONTROL.keys[i]) // Detect END FLAG
                        break;
                    for (int j = 0; (infoBufCCONTROL.keys[j]) && (j < BTKeyboard::MAX_KEY_COUNT); j++)
                    {
                        if (infoCCONTROL.keys[i] == infoBufCCONTROL.keys[j])
                        {
                            found = true;
                            break;
                        }
                    }
                    if (!found)
                    {
                        ESP_LOGD(TAG, "Down CCONTROL key: %x", infoCCONTROL.keys[i]);
                        keyboard.keyHid_send_CCONTROL(infoCCONTROL.keys[i], true);
                        gpio_set_level(GPIO_NUM_2, 0);
                    }
                    else
                        found = false;
                }

                infoBufCCONTROL = infoCCONTROL; // Now all the keys are handled, we save the state
            }
        }
    }
}

