A2ThreeD/esp32-bt2ps2/main/main.cpp
void mouse_task(void *arg)
{
    BTKeyboard::Mouse_Control infoMouse;    // freshly received mouse report
    BTKeyboard::Mouse_Control infoMouseBuf; // currently pressed mouse report
    uint32_t mouseEvents = 0;

    while (true)
    {
        if (bt_keyboard.wait_for_low_event_MOUSE(infoMouse)) // return immediately if queue empty
        {
            mouseEvents++;
            if (BT2PS2_MOUSE_DEBUG && ((mouseEvents % 25) == 0))
            {
                ESP_LOGI(TAG, "MOUSE EVT #%lu route=amiga-db9 B=%u X=%d Y=%d W=%d",
                         (unsigned long)mouseEvents, infoMouse.mouse_buttons, infoMouse.mouse_x, infoMouse.mouse_y, infoMouse.mouse_w);
            }

            mouse.move(infoMouse.mouse_x, infoMouse.mouse_y, infoMouse.mouse_w);
            mouse.set_buttons(infoMouse.mouse_buttons & 0b111);
            if ((infoMouse.mouse_buttons & 0b111) != (infoMouseBuf.mouse_buttons & 0b111))
                gpio_set_level(GPIO_NUM_2, (infoMouse.mouse_buttons & 0b111) ? 0 : 1);
            infoMouseBuf = infoMouse; // Now all the keys are handled, we save the state
        }
    }
}

void ble_connection_daemon(void *arg)
{
    while (true)
    {
        if (!pairingRequested)
        {
            bleNowScanning = true;
            bt_keyboard.devices_scan_ble_daemon();
            ESP_LOGD(TAG, "RAM left %d", esp_get_free_heap_size());
        }
        else
        {
            ESP_LOGI(TAG, "Pairing requested! Stopping BLE connection daemon...");
            bleNowScanning = false;
            while (pairingRequested)
                vTaskDelay(5000 / portTICK_PERIOD_MS);
        }
    }
}
